articles/ages.tex
% Created 2024-08-27 Tue 10:14
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.28)}, 
 pdflang={English}}
\begin{document}

\tableofcontents




\section{Ages Encription}
\label{sec:orgc5b72a2}

\subsection{Age Command Examples}
\label{sec:org628d134}

\begin{enumerate}
\item Generate an encrypted file that can be decrypted with a passphrase:
\end{enumerate}

\begin{verbatim}
$ age --passphrase --output /path/to/encrypted_file /path/to/unencrypted_file
\end{verbatim}

\begin{enumerate}
\item Generate a key pair, saving the private key to an unencrypted file and printing the public key to stdout:
\end{enumerate}

\begin{verbatim}

$ age-keygen --output /path/to/file

\end{verbatim}

\begin{enumerate}
\item Encrypt a file with one or more public keys that are entered as literals:
\end{enumerate}

\begin{verbatim}

$ age --recipient public_key_1 --recipient public_key_2 /path/to/unencrypted_file --output /path/to/encrypted_file

\end{verbatim}

\begin{enumerate}
\item Encrypt a file with one or more public keys that are specified in a recipients file:
\end{enumerate}

\begin{verbatim}

$ age --recipients-file /path/to/recipients_file /path/to/unencrypted_file --output /path/to/encrypted_file

\end{verbatim}

\begin{enumerate}
\item Decrypt a file with a passphrase:
\end{enumerate}

\begin{verbatim}

$ age --decrypt --output /path/to/decrypted_file /path/to/encrypted_file

\end{verbatim}

\begin{enumerate}
\item Decrypt a file with a private key file:
\end{enumerate}

\begin{verbatim}

$ age --decrypt --identity /path/to/private_key_file --output /path/to/decrypted_file /path/to/encrypted_file

\end{verbatim}

\subsection{Summary}
\label{sec:orgc80d139}

In summary, Age is a modern and secure file encryption tool that prioritizes simplicity, security, and user-friendliness. With its support for modern encryption algorithms, secure key management practices, and compatibility across platforms, Age provides a reliable solution for encrypting and decrypting files while ensuring the confidentiality and integrity of sensitive data.
\end{document}
